{"format": "layers-model", "generatedBy": null, "convertedBy": "TensorFlow.js Converter v3.21.0", "modelTopology": null, "weightsManifest": [{"paths": ["group1-shard1of1.bin"], "weights": [{"name": "hourglass_pre/kernel", "shape": [7, 7, 1, 64], "dtype": "float32"}, {"name": "hourglass_pre/bias", "shape": [64], "dtype": "float32"}, {"name": "hourglass_pre_BatchNorm/gamma", "shape": [64], "dtype": "float32"}, {"name": "hourglass_pre_BatchNorm/beta", "shape": [64], "dtype": "float32"}, {"name": "hourglass_pre_BatchNorm/moving_mean", "shape": [64], "dtype": "float32"}, {"name": "hourglass_pre_BatchNorm/moving_variance", "shape": [64], "dtype": "float32"}, {"name": "hourglass_pre_res1_conv1_BatchNorm/gamma", "shape": [64], "dtype": "float32"}, {"name": "hourglass_pre_res1_conv1_BatchNorm/beta", "shape": [64], "dtype": "float32"}, {"name": "hourglass_pre_res1_conv1_BatchNorm/moving_mean", "shape": [64], "dtype": "float32"}, {"name": "hourglass_pre_res1_conv1_BatchNorm/moving_variance", "shape": [64], "dtype": "float32"}, {"name": "hourglass_pre_res1_conv1/kernel", "shape": [1, 1, 64, 64], "dtype": "float32"}, {"name": "hourglass_pre_res1_conv1/bias", "shape": [64], "dtype": "float32"}, {"name": "hourglass_pre_res1_conv2_BatchNorm/gamma", "shape": [64], "dtype": "float32"}, {"name": "hourglass_pre_res1_conv2_BatchNorm/beta", "shape": [64], "dtype": "float32"}, {"name": "hourglass_pre_res1_conv2_BatchNorm/moving_mean", "shape": [64], "dtype": "float32"}, {"name": "hourglass_pre_res1_conv2_BatchNorm/moving_variance", "shape": [64], "dtype": "float32"}, {"name": "hourglass_pre_res1_conv2/kernel", "shape": [3, 3, 64, 64], "dtype": "float32"}, {"name": "hourglass_pre_res1_conv2/bias", "shape": [64], "dtype": "float32"}, {"name": "hourglass_pre_res1_conv3_BatchNorm/gamma", "shape": [64], "dtype": "float32"}, {"name": "hourglass_pre_res1_conv3_BatchNorm/beta", "shape": [64], "dtype": "float32"}, {"name": "hourglass_pre_res1_conv3_BatchNorm/moving_mean", "shape": [64], "dtype": "float32"}, {"name": "hourglass_pre_res1_conv3_BatchNorm/moving_variance", "shape": [64], "dtype": "float32"}, {"name": "hourglass_pre_res1_conv3/kernel", "shape": [1, 1, 64, 128], "dtype": "float32"}, {"name": "hourglass_pre_res1_conv3/bias", "shape": [128], "dtype": "float32"}, {"name": "hourglass_pre_res1_skip/kernel", "shape": [1, 1, 64, 128], "dtype": "float32"}, {"name": "hourglass_pre_res1_skip/bias", "shape": [128], "dtype": "float32"}, {"name": "hourglass_pre_res2_conv1_BatchNorm/gamma", "shape": [128], "dtype": "float32"}, {"name": "hourglass_pre_res2_conv1_BatchNorm/beta", "shape": [128], "dtype": "float32"}, {"name": "hourglass_pre_res2_conv1_BatchNorm/moving_mean", "shape": [128], "dtype": "float32"}, {"name": "hourglass_pre_res2_conv1_BatchNorm/moving_variance", "shape": [128], "dtype": "float32"}, {"name": "hourglass_pre_res2_conv1/kernel", "shape": [1, 1, 128, 32], "dtype": "float32"}, {"name": "hourglass_pre_res2_conv1/bias", "shape": [32], "dtype": "float32"}, {"name": "hourglass_pre_res2_conv2_BatchNorm/gamma", "shape": [32], "dtype": "float32"}, {"name": "hourglass_pre_res2_conv2_BatchNorm/beta", "shape": [32], "dtype": "float32"}, {"name": "hourglass_pre_res2_conv2_BatchNorm/moving_mean", "shape": [32], "dtype": "float32"}, {"name": "hourglass_pre_res2_conv2_BatchNorm/moving_variance", "shape": [32], "dtype": "float32"}, {"name": "hourglass_pre_res2_conv2/kernel", "shape": [3, 3, 32, 32], "dtype": "float32"}, {"name": "hourglass_pre_res2_conv2/bias", "shape": [32], "dtype": "float32"}, {"name": "hourglass_pre_res2_conv3_BatchNorm/gamma", "shape": [32], "dtype": "float32"}, {"name": "hourglass_pre_res2_conv3_BatchNorm/beta", "shape": [32], "dtype": "float32"}, {"name": "hourglass_pre_res2_conv3_BatchNorm/moving_mean", "shape": [32], "dtype": "float32"}, {"name": "hourglass_pre_res2_conv3_BatchNorm/moving_variance", "shape": [32], "dtype": "float32"}, {"name": "hourglass_pre_res2_conv3/kernel", "shape": [1, 1, 32, 64], "dtype": "float32"}, {"name": "hourglass_pre_res2_conv3/bias", "shape": [64], "dtype": "float32"}, {"name": "hourglass_pre_res2_skip/kernel", "shape": [1, 1, 128, 64], "dtype": "float32"}, {"name": "hourglass_pre_res2_skip/bias", "shape": [64], "dtype": "float32"}, {"name": "hourglass_hg_1_depth1_low1_1_conv1_BatchNorm/gamma", "shape": [64], "dtype": "float32"}, {"name": "hourglass_hg_1_depth1_low1_1_conv1_BatchNorm/beta", "shape": [64], "dtype": "float32"}, {"name": "hourglass_hg_1_depth1_low1_1_conv1_BatchNorm/moving_mean", "shape": [64], "dtype": "float32"}, {"name": "hourglass_hg_1_depth1_low1_1_conv1_BatchNorm/moving_variance", "shape": [64], "dtype": "float32"}, {"name": "hourglass_hg_1_depth1_low1_1_conv1/kernel", "shape": [1, 1, 64, 32], "dtype": "float32"}, {"name": "hourglass_hg_1_depth1_low1_1_conv1/bias", "shape": [32], "dtype": "float32"}, {"name": "hourglass_hg_1_depth1_low1_1_conv2_BatchNorm/gamma", "shape": [32], "dtype": "float32"}, {"name": "hourglass_hg_1_depth1_low1_1_conv2_BatchNorm/beta", "shape": [32], "dtype": "float32"}, {"name": "hourglass_hg_1_depth1_low1_1_conv2_BatchNorm/moving_mean", "shape": [32], "dtype": "float32"}, {"name": "hourglass_hg_1_depth1_low1_1_conv2_BatchNorm/moving_variance", "shape": [32], "dtype": "float32"}, {"name": "hourglass_hg_1_depth1_low1_1_conv2/kernel", "shape": [3, 3, 32, 32], "dtype": "float32"}, {"name": "hourglass_hg_1_depth1_low1_1_conv2/bias", "shape": [32], "dtype": "float32"}, {"name": "hourglass_hg_1_depth1_low1_1_conv3_BatchNorm/gamma", "shape": [32], "dtype": "float32"}, {"name": "hourglass_hg_1_depth1_low1_1_conv3_BatchNorm/beta", "shape": [32], "dtype": "float32"}, {"name": "hourglass_hg_1_depth1_low1_1_conv3_BatchNorm/moving_mean", "shape": [32], "dtype": "float32"}, {"name": "hourglass_hg_1_depth1_low1_1_conv3_BatchNorm/moving_variance", "shape": [32], "dtype": "float32"}, {"name": "hourglass_hg_1_depth1_low1_1_conv3/kernel", "shape": [1, 1, 32, 64], "dtype": "float32"}, {"name": "hourglass_hg_1_depth1_low1_1_conv3/bias", "shape": [64], "dtype": "float32"}, {"name": "hourglass_hg_1_depth1_depth2_low1_1_conv1_BatchNorm/gamma", "shape": [64], "dtype": "float32"}, {"name": "hourglass_hg_1_depth1_depth2_low1_1_conv1_BatchNorm/beta", "shape": [64], "dtype": "float32"}, {"name": "hourglass_hg_1_depth1_depth2_low1_1_conv1_BatchNorm/moving_mean", "shape": [64], "dtype": "float32"}, {"name": "hourglass_hg_1_depth1_depth2_low1_1_conv1_BatchNorm/moving_variance", "shape": [64], "dtype": "float32"}, {"name": "hourglass_hg_1_depth1_depth2_low1_1_conv1/kernel", "shape": [1, 1, 64, 32], "dtype": "float32"}, {"name": "hourglass_hg_1_depth1_depth2_low1_1_conv1/bias", "shape": [32], "dtype": "float32"}, {"name": "hourglass_hg_1_depth1_depth2_low1_1_conv2_BatchNorm/gamma", "shape": [32], "dtype": "float32"}, {"name": "hourglass_hg_1_depth1_depth2_low1_1_conv2_BatchNorm/beta", "shape": [32], "dtype": "float32"}, {"name": "hourglass_hg_1_depth1_depth2_low1_1_conv2_BatchNorm/moving_mean", "shape": [32], "dtype": "float32"}, {"name": "hourglass_hg_1_depth1_depth2_low1_1_conv2_BatchNorm/moving_variance", "shape": [32], "dtype": "float32"}, {"name": "hourglass_hg_1_depth1_depth2_low1_1_conv2/kernel", "shape": [3, 3, 32, 32], "dtype": "float32"}, {"name": "hourglass_hg_1_depth1_depth2_low1_1_conv2/bias", "shape": [32], "dtype": "float32"}, {"name": "hourglass_hg_1_depth1_depth2_low1_1_conv3_BatchNorm/gamma", "shape": [32], "dtype": "float32"}, {"name": "hourglass_hg_1_depth1_depth2_low1_1_conv3_BatchNorm/beta", "shape": [32], "dtype": "float32"}, {"name": "hourglass_hg_1_depth1_depth2_low1_1_conv3_BatchNorm/moving_mean", "shape": [32], "dtype": "float32"}, {"name": "hourglass_hg_1_depth1_depth2_low1_1_conv3_BatchNorm/moving_variance", "shape": [32], "dtype": "float32"}, {"name": "hourglass_hg_1_depth1_depth2_low1_1_conv3/kernel", "shape": [1, 1, 32, 64], "dtype": "float32"}, {"name": "hourglass_hg_1_depth1_depth2_low1_1_conv3/bias", "shape": [64], "dtype": "float32"}, {"name": "hourglass_hg_1_depth1_depth2_depth3_low1_1_conv1_BatchNorm/gamma", "shape": [64], "dtype": "float32"}, {"name": "hourglass_hg_1_depth1_depth2_depth3_low1_1_conv1_BatchNorm/beta", "shape": [64], "dtype": "float32"}, {"name": "hourglass_hg_1_depth1_depth2_depth3_low1_1_conv1_BatchNorm/moving_mean", "shape": [64], "dtype": "float32"}, {"name": "hourglass_hg_1_depth1_depth2_depth3_low1_1_conv1_BatchNorm/moving_variance", "shape": [64], "dtype": "float32"}, {"name": "hourglass_hg_1_depth1_depth2_depth3_low1_1_conv1/kernel", "shape": [1, 1, 64, 32], "dtype": "float32"}, {"name": "hourglass_hg_1_depth1_depth2_depth3_low1_1_conv1/bias", "shape": [32], "dtype": "float32"}, {"name": "hourglass_hg_1_depth1_depth2_depth3_low1_1_conv2_BatchNorm/gamma", "shape": [32], "dtype": "float32"}, {"name": "hourglass_hg_1_depth1_depth2_depth3_low1_1_conv2_BatchNorm/beta", "shape": [32], "dtype": "float32"}, {"name": "hourglass_hg_1_depth1_depth2_depth3_low1_1_conv2_BatchNorm/moving_mean", "shape": [32], "dtype": "float32"}, {"name": "hourglass_hg_1_depth1_depth2_depth3_low1_1_conv2_BatchNorm/moving_variance", "shape": [32], "dtype": "float32"}, {"name": "hourglass_hg_1_depth1_depth2_depth3_low1_1_conv2/kernel", "shape": [3, 3, 32, 32], "dtype": "float32"}, {"name": "hourglass_hg_1_depth1_depth2_depth3_low1_1_conv2/bias", "shape": [32], "dtype": "float32"}, {"name": "hourglass_hg_1_depth1_depth2_depth3_low1_1_conv3_BatchNorm/gamma", "shape": [32], "dtype": "float32"}, {"name": "hourglass_hg_1_depth1_depth2_depth3_low1_1_conv3_BatchNorm/beta", "shape": [32], "dtype": "float32"}, {"name": "hourglass_hg_1_depth1_depth2_depth3_low1_1_conv3_BatchNorm/moving_mean", "shape": [32], "dtype": "float32"}, {"name": "hourglass_hg_1_depth1_depth2_depth3_low1_1_conv3_BatchNorm/moving_variance", "shape": [32], "dtype": "float32"}, {"name": "hourglass_hg_1_depth1_depth2_depth3_low1_1_conv3/kernel", "shape": [1, 1, 32, 64], "dtype": "float32"}, {"name": "hourglass_hg_1_depth1_depth2_depth3_low1_1_conv3/bias", "shape": [64], "dtype": "float32"}, {"name": "hourglass_hg_1_depth1_depth2_depth3_depth4_low1_1_conv1_BatchNorm/gamma", "shape": [64], "dtype": "float32"}, {"name": "hourglass_hg_1_depth1_depth2_depth3_depth4_low1_1_conv1_BatchNorm/beta", "shape": [64], "dtype": "float32"}, {"name": "hourglass_hg_1_depth1_depth2_depth3_depth4_low1_1_conv1_BatchNorm/moving_mean", "shape": [64], "dtype": "float32"}, {"name": "hourglass_hg_1_depth1_depth2_depth3_depth4_low1_1_conv1_BatchNorm/moving_variance", "shape": [64], "dtype": "float32"}, {"name": "hourglass_hg_1_depth1_depth2_depth3_depth4_low1_1_conv1/kernel", "shape": [1, 1, 64, 32], "dtype": "float32"}, {"name": "hourglass_hg_1_depth1_depth2_depth3_depth4_low1_1_conv1/bias", "shape": [32], "dtype": "float32"}, {"name": "hourglass_hg_1_depth1_depth2_depth3_depth4_low1_1_conv2_BatchNorm/gamma", "shape": [32], "dtype": "float32"}, {"name": "hourglass_hg_1_depth1_depth2_depth3_depth4_low1_1_conv2_BatchNorm/beta", "shape": [32], "dtype": "float32"}, {"name": "hourglass_hg_1_depth1_depth2_depth3_depth4_low1_1_conv2_BatchNorm/moving_mean", "shape": [32], "dtype": "float32"}, {"name": "hourglass_hg_1_depth1_depth2_depth3_depth4_low1_1_conv2_BatchNorm/moving_variance", "shape": [32], "dtype": "float32"}, {"name": "hourglass_hg_1_depth1_depth2_depth3_depth4_low1_1_conv2/kernel", "shape": [3, 3, 32, 32], "dtype": "float32"}, {"name": "hourglass_hg_1_depth1_depth2_depth3_depth4_low1_1_conv2/bias", "shape": [32], "dtype": "float32"}, {"name": "hourglass_hg_1_depth1_depth2_depth3_depth4_low1_1_conv3_BatchNorm/gamma", "shape": [32], "dtype": "float32"}, {"name": "hourglass_hg_1_depth1_depth2_depth3_depth4_low1_1_conv3_BatchNorm/beta", "shape": [32], "dtype": "float32"}, {"name": "hourglass_hg_1_depth1_depth2_depth3_depth4_low1_1_conv3_BatchNorm/moving_mean", "shape": [32], "dtype": "float32"}, {"name": "hourglass_hg_1_depth1_depth2_depth3_depth4_low1_1_conv3_BatchNorm/moving_variance", "shape": [32], "dtype": "float32"}, {"name": "hourglass_hg_1_depth1_depth2_depth3_depth4_low1_1_conv3/kernel", "shape": [1, 1, 32, 64], "dtype": "float32"}, {"name": "hourglass_hg_1_depth1_depth2_depth3_depth4_low1_1_conv3/bias", "shape": [64], "dtype": "float32"}, {"name": "hourglass_hg_1_depth1_depth2_depth3_depth4_low2_1_conv1_BatchNorm/gamma", "shape": [64], "dtype": "float32"}, {"name": "hourglass_hg_1_depth1_depth2_depth3_depth4_low2_1_conv1_BatchNorm/beta", "shape": [64], "dtype": "float32"}, {"name": "hourglass_hg_1_depth1_depth2_depth3_depth4_low2_1_conv1_BatchNorm/moving_mean", "shape": [64], "dtype": "float32"}, {"name": "hourglass_hg_1_depth1_depth2_depth3_depth4_low2_1_conv1_BatchNorm/moving_variance", "shape": [64], "dtype": "float32"}, {"name": "hourglass_hg_1_depth1_depth2_depth3_depth4_low2_1_conv1/kernel", "shape": [1, 1, 64, 32], "dtype": "float32"}, {"name": "hourglass_hg_1_depth1_depth2_depth3_depth4_low2_1_conv1/bias", "shape": [32], "dtype": "float32"}, {"name": "hourglass_hg_1_depth1_depth2_depth3_depth4_low2_1_conv2_BatchNorm/gamma", "shape": [32], "dtype": "float32"}, {"name": "hourglass_hg_1_depth1_depth2_depth3_depth4_low2_1_conv2_BatchNorm/beta", "shape": [32], "dtype": "float32"}, {"name": "hourglass_hg_1_depth1_depth2_depth3_depth4_low2_1_conv2_BatchNorm/moving_mean", "shape": [32], "dtype": "float32"}, {"name": "hourglass_hg_1_depth1_depth2_depth3_depth4_low2_1_conv2_BatchNorm/moving_variance", "shape": [32], "dtype": "float32"}, {"name": "hourglass_hg_1_depth1_depth2_depth3_depth4_low2_1_conv2/kernel", "shape": [3, 3, 32, 32], "dtype": "float32"}, {"name": "hourglass_hg_1_depth1_depth2_depth3_depth4_low2_1_conv2/bias", "shape": [32], "dtype": "float32"}, {"name": "hourglass_hg_1_depth1_depth2_depth3_depth4_low2_1_conv3_BatchNorm/gamma", "shape": [32], "dtype": "float32"}, {"name": "hourglass_hg_1_depth1_depth2_depth3_depth4_low2_1_conv3_BatchNorm/beta", "shape": [32], "dtype": "float32"}, {"name": "hourglass_hg_1_depth1_depth2_depth3_depth4_low2_1_conv3_BatchNorm/moving_mean", "shape": [32], "dtype": "float32"}, {"name": "hourglass_hg_1_depth1_depth2_depth3_depth4_low2_1_conv3_BatchNorm/moving_variance", "shape": [32], "dtype": "float32"}, {"name": "hourglass_hg_1_depth1_depth2_depth3_depth4_low2_1_conv3/kernel", "shape": [1, 1, 32, 64], "dtype": "float32"}, {"name": "hourglass_hg_1_depth1_depth2_depth3_depth4_low2_1_conv3/bias", "shape": [64], "dtype": "float32"}, {"name": "hourglass_hg_1_depth1_depth2_depth3_depth4_up1_1_conv1_BatchNorm/gamma", "shape": [64], "dtype": "float32"}, {"name": "hourglass_hg_1_depth1_depth2_depth3_depth4_up1_1_conv1_BatchNorm/beta", "shape": [64], "dtype": "float32"}, {"name": "hourglass_hg_1_depth1_depth2_depth3_depth4_up1_1_conv1_BatchNorm/moving_mean", "shape": [64], "dtype": "float32"}, {"name": "hourglass_hg_1_depth1_depth2_depth3_depth4_up1_1_conv1_BatchNorm/moving_variance", "shape": [64], "dtype": "float32"}, {"name": "hourglass_hg_1_depth1_depth2_depth3_depth4_low3_1_conv1_BatchNorm/gamma", "shape": [64], "dtype": "float32"}, {"name": "hourglass_hg_1_depth1_depth2_depth3_depth4_low3_1_conv1_BatchNorm/beta", "shape": [64], "dtype": "float32"}, {"name": "hourglass_hg_1_depth1_depth2_depth3_depth4_low3_1_conv1_BatchNorm/moving_mean", "shape": [64], "dtype": "float32"}, {"name": "hourglass_hg_1_depth1_depth2_depth3_depth4_low3_1_conv1_BatchNorm/moving_variance", "shape": [64], "dtype": "float32"}, {"name": "hourglass_hg_1_depth1_depth2_depth3_depth4_up1_1_conv1/kernel", "shape": [1, 1, 64, 32], "dtype": "float32"}, {"name": "hourglass_hg_1_depth1_depth2_depth3_depth4_up1_1_conv1/bias", "shape": [32], "dtype": "float32"}, {"name": "hourglass_hg_1_depth1_depth2_depth3_depth4_low3_1_conv1/kernel", "shape": [1, 1, 64, 32], "dtype": "float32"}, {"name": "hourglass_hg_1_depth1_depth2_depth3_depth4_low3_1_conv1/bias", "shape": [32], "dtype": "float32"}, {"name": "hourglass_hg_1_depth1_depth2_depth3_depth4_up1_1_conv2_BatchNorm/gamma", "shape": [32], "dtype": "float32"}, {"name": "hourglass_hg_1_depth1_depth2_depth3_depth4_up1_1_conv2_BatchNorm/beta", "shape": [32], "dtype": "float32"}, {"name": "hourglass_hg_1_depth1_depth2_depth3_depth4_up1_1_conv2_BatchNorm/moving_mean", "shape": [32], "dtype": "float32"}, {"name": "hourglass_hg_1_depth1_depth2_depth3_depth4_up1_1_conv2_BatchNorm/moving_variance", "shape": [32], "dtype": "float32"}, {"name": "hourglass_hg_1_depth1_depth2_depth3_depth4_low3_1_conv2_BatchNorm/gamma", "shape": [32], "dtype": "float32"}, {"name": "hourglass_hg_1_depth1_depth2_depth3_depth4_low3_1_conv2_BatchNorm/beta", "shape": [32], "dtype": "float32"}, {"name": "hourglass_hg_1_depth1_depth2_depth3_depth4_low3_1_conv2_BatchNorm/moving_mean", "shape": [32], "dtype": "float32"}, {"name": "hourglass_hg_1_depth1_depth2_depth3_depth4_low3_1_conv2_BatchNorm/moving_variance", "shape": [32], "dtype": "float32"}, {"name": "hourglass_hg_1_depth1_depth2_depth3_depth4_up1_1_conv2/kernel", "shape": [3, 3, 32, 32], "dtype": "float32"}, {"name": "hourglass_hg_1_depth1_depth2_depth3_depth4_up1_1_conv2/bias", "shape": [32], "dtype": "float32"}, {"name": "hourglass_hg_1_depth1_depth2_depth3_depth4_low3_1_conv2/kernel", "shape": [3, 3, 32, 32], "dtype": "float32"}, {"name": "hourglass_hg_1_depth1_depth2_depth3_depth4_low3_1_conv2/bias", "shape": [32], "dtype": "float32"}, {"name": "hourglass_hg_1_depth1_depth2_depth3_depth4_up1_1_conv3_BatchNorm/gamma", "shape": [32], "dtype": "float32"}, {"name": "hourglass_hg_1_depth1_depth2_depth3_depth4_up1_1_conv3_BatchNorm/beta", "shape": [32], "dtype": "float32"}, {"name": "hourglass_hg_1_depth1_depth2_depth3_depth4_up1_1_conv3_BatchNorm/moving_mean", "shape": [32], "dtype": "float32"}, {"name": "hourglass_hg_1_depth1_depth2_depth3_depth4_up1_1_conv3_BatchNorm/moving_variance", "shape": [32], "dtype": "float32"}, {"name": "hourglass_hg_1_depth1_depth2_depth3_depth4_low3_1_conv3_BatchNorm/gamma", "shape": [32], "dtype": "float32"}, {"name": "hourglass_hg_1_depth1_depth2_depth3_depth4_low3_1_conv3_BatchNorm/beta", "shape": [32], "dtype": "float32"}, {"name": "hourglass_hg_1_depth1_depth2_depth3_depth4_low3_1_conv3_BatchNorm/moving_mean", "shape": [32], "dtype": "float32"}, {"name": "hourglass_hg_1_depth1_depth2_depth3_depth4_low3_1_conv3_BatchNorm/moving_variance", "shape": [32], "dtype": "float32"}, {"name": "hourglass_hg_1_depth1_depth2_depth3_depth4_up1_1_conv3/kernel", "shape": [1, 1, 32, 64], "dtype": "float32"}, {"name": "hourglass_hg_1_depth1_depth2_depth3_depth4_up1_1_conv3/bias", "shape": [64], "dtype": "float32"}, {"name": "hourglass_hg_1_depth1_depth2_depth3_depth4_low3_1_conv3/kernel", "shape": [1, 1, 32, 64], "dtype": "float32"}, {"name": "hourglass_hg_1_depth1_depth2_depth3_depth4_low3_1_conv3/bias", "shape": [64], "dtype": "float32"}, {"name": "hourglass_hg_1_depth1_depth2_depth3_up1_1_conv1_BatchNorm/gamma", "shape": [64], "dtype": "float32"}, {"name": "hourglass_hg_1_depth1_depth2_depth3_up1_1_conv1_BatchNorm/beta", "shape": [64], "dtype": "float32"}, {"name": "hourglass_hg_1_depth1_depth2_depth3_up1_1_conv1_BatchNorm/moving_mean", "shape": [64], "dtype": "float32"}, {"name": "hourglass_hg_1_depth1_depth2_depth3_up1_1_conv1_BatchNorm/moving_variance", "shape": [64], "dtype": "float32"}, {"name": "hourglass_hg_1_depth1_depth2_depth3_low3_1_conv1_BatchNorm/gamma", "shape": [64], "dtype": "float32"}, {"name": "hourglass_hg_1_depth1_depth2_depth3_low3_1_conv1_BatchNorm/beta", "shape": [64], "dtype": "float32"}, {"name": "hourglass_hg_1_depth1_depth2_depth3_low3_1_conv1_BatchNorm/moving_mean", "shape": [64], "dtype": "float32"}, {"name": "hourglass_hg_1_depth1_depth2_depth3_low3_1_conv1_BatchNorm/moving_variance", "shape": [64], "dtype": "float32"}, {"name": "hourglass_hg_1_depth1_depth2_depth3_up1_1_conv1/kernel", "shape": [1, 1, 64, 32], "dtype": "float32"}, {"name": "hourglass_hg_1_depth1_depth2_depth3_up1_1_conv1/bias", "shape": [32], "dtype": "float32"}, {"name": "hourglass_hg_1_depth1_depth2_depth3_low3_1_conv1/kernel", "shape": [1, 1, 64, 32], "dtype": "float32"}, {"name": "hourglass_hg_1_depth1_depth2_depth3_low3_1_conv1/bias", "shape": [32], "dtype": "float32"}, {"name": "hourglass_hg_1_depth1_depth2_depth3_up1_1_conv2_BatchNorm/gamma", "shape": [32], "dtype": "float32"}, {"name": "hourglass_hg_1_depth1_depth2_depth3_up1_1_conv2_BatchNorm/beta", "shape": [32], "dtype": "float32"}, {"name": "hourglass_hg_1_depth1_depth2_depth3_up1_1_conv2_BatchNorm/moving_mean", "shape": [32], "dtype": "float32"}, {"name": "hourglass_hg_1_depth1_depth2_depth3_up1_1_conv2_BatchNorm/moving_variance", "shape": [32], "dtype": "float32"}, {"name": "hourglass_hg_1_depth1_depth2_depth3_low3_1_conv2_BatchNorm/gamma", "shape": [32], "dtype": "float32"}, {"name": "hourglass_hg_1_depth1_depth2_depth3_low3_1_conv2_BatchNorm/beta", "shape": [32], "dtype": "float32"}, {"name": "hourglass_hg_1_depth1_depth2_depth3_low3_1_conv2_BatchNorm/moving_mean", "shape": [32], "dtype": "float32"}, {"name": "hourglass_hg_1_depth1_depth2_depth3_low3_1_conv2_BatchNorm/moving_variance", "shape": [32], "dtype": "float32"}, {"name": "hourglass_hg_1_depth1_depth2_depth3_up1_1_conv2/kernel", "shape": [3, 3, 32, 32], "dtype": "float32"}, {"name": "hourglass_hg_1_depth1_depth2_depth3_up1_1_conv2/bias", "shape": [32], "dtype": "float32"}, {"name": "hourglass_hg_1_depth1_depth2_depth3_low3_1_conv2/kernel", "shape": [3, 3, 32, 32], "dtype": "float32"}, {"name": "hourglass_hg_1_depth1_depth2_depth3_low3_1_conv2/bias", "shape": [32], "dtype": "float32"}, {"name": "hourglass_hg_1_depth1_depth2_depth3_up1_1_conv3_BatchNorm/gamma", "shape": [32], "dtype": "float32"}, {"name": "hourglass_hg_1_depth1_depth2_depth3_up1_1_conv3_BatchNorm/beta", "shape": [32], "dtype": "float32"}, {"name": "hourglass_hg_1_depth1_depth2_depth3_up1_1_conv3_BatchNorm/moving_mean", "shape": [32], "dtype": "float32"}, {"name": "hourglass_hg_1_depth1_depth2_depth3_up1_1_conv3_BatchNorm/moving_variance", "shape": [32], "dtype": "float32"}, {"name": "hourglass_hg_1_depth1_depth2_depth3_low3_1_conv3_BatchNorm/gamma", "shape": [32], "dtype": "float32"}, {"name": "hourglass_hg_1_depth1_depth2_depth3_low3_1_conv3_BatchNorm/beta", "shape": [32], "dtype": "float32"}, {"name": "hourglass_hg_1_depth1_depth2_depth3_low3_1_conv3_BatchNorm/moving_mean", "shape": [32], "dtype": "float32"}, {"name": "hourglass_hg_1_depth1_depth2_depth3_low3_1_conv3_BatchNorm/moving_variance", "shape": [32], "dtype": "float32"}, {"name": "hourglass_hg_1_depth1_depth2_depth3_up1_1_conv3/kernel", "shape": [1, 1, 32, 64], "dtype": "float32"}, {"name": "hourglass_hg_1_depth1_depth2_depth3_up1_1_conv3/bias", "shape": [64], "dtype": "float32"}, {"name": "hourglass_hg_1_depth1_depth2_depth3_low3_1_conv3/kernel", "shape": [1, 1, 32, 64], "dtype": "float32"}, {"name": "hourglass_hg_1_depth1_depth2_depth3_low3_1_conv3/bias", "shape": [64], "dtype": "float32"}, {"name": "hourglass_hg_1_depth1_depth2_up1_1_conv1_BatchNorm/gamma", "shape": [64], "dtype": "float32"}, {"name": "hourglass_hg_1_depth1_depth2_up1_1_conv1_BatchNorm/beta", "shape": [64], "dtype": "float32"}, {"name": "hourglass_hg_1_depth1_depth2_up1_1_conv1_BatchNorm/moving_mean", "shape": [64], "dtype": "float32"}, {"name": "hourglass_hg_1_depth1_depth2_up1_1_conv1_BatchNorm/moving_variance", "shape": [64], "dtype": "float32"}, {"name": "hourglass_hg_1_depth1_depth2_low3_1_conv1_BatchNorm/gamma", "shape": [64], "dtype": "float32"}, {"name": "hourglass_hg_1_depth1_depth2_low3_1_conv1_BatchNorm/beta", "shape": [64], "dtype": "float32"}, {"name": "hourglass_hg_1_depth1_depth2_low3_1_conv1_BatchNorm/moving_mean", "shape": [64], "dtype": "float32"}, {"name": "hourglass_hg_1_depth1_depth2_low3_1_conv1_BatchNorm/moving_variance", "shape": [64], "dtype": "float32"}, {"name": "hourglass_hg_1_depth1_depth2_up1_1_conv1/kernel", "shape": [1, 1, 64, 32], "dtype": "float32"}, {"name": "hourglass_hg_1_depth1_depth2_up1_1_conv1/bias", "shape": [32], "dtype": "float32"}, {"name": "hourglass_hg_1_depth1_depth2_low3_1_conv1/kernel", "shape": [1, 1, 64, 32], "dtype": "float32"}, {"name": "hourglass_hg_1_depth1_depth2_low3_1_conv1/bias", "shape": [32], "dtype": "float32"}, {"name": "hourglass_hg_1_depth1_depth2_up1_1_conv2_BatchNorm/gamma", "shape": [32], "dtype": "float32"}, {"name": "hourglass_hg_1_depth1_depth2_up1_1_conv2_BatchNorm/beta", "shape": [32], "dtype": "float32"}, {"name": "hourglass_hg_1_depth1_depth2_up1_1_conv2_BatchNorm/moving_mean", "shape": [32], "dtype": "float32"}, {"name": "hourglass_hg_1_depth1_depth2_up1_1_conv2_BatchNorm/moving_variance", "shape": [32], "dtype": "float32"}, {"name": "hourglass_hg_1_depth1_depth2_low3_1_conv2_BatchNorm/gamma", "shape": [32], "dtype": "float32"}, {"name": "hourglass_hg_1_depth1_depth2_low3_1_conv2_BatchNorm/beta", "shape": [32], "dtype": "float32"}, {"name": "hourglass_hg_1_depth1_depth2_low3_1_conv2_BatchNorm/moving_mean", "shape": [32], "dtype": "float32"}, {"name": "hourglass_hg_1_depth1_depth2_low3_1_conv2_BatchNorm/moving_variance", "shape": [32], "dtype": "float32"}, {"name": "hourglass_hg_1_depth1_depth2_up1_1_conv2/kernel", "shape": [3, 3, 32, 32], "dtype": "float32"}, {"name": "hourglass_hg_1_depth1_depth2_up1_1_conv2/bias", "shape": [32], "dtype": "float32"}, {"name": "hourglass_hg_1_depth1_depth2_low3_1_conv2/kernel", "shape": [3, 3, 32, 32], "dtype": "float32"}, {"name": "hourglass_hg_1_depth1_depth2_low3_1_conv2/bias", "shape": [32], "dtype": "float32"}, {"name": "hourglass_hg_1_depth1_depth2_up1_1_conv3_BatchNorm/gamma", "shape": [32], "dtype": "float32"}, {"name": "hourglass_hg_1_depth1_depth2_up1_1_conv3_BatchNorm/beta", "shape": [32], "dtype": "float32"}, {"name": "hourglass_hg_1_depth1_depth2_up1_1_conv3_BatchNorm/moving_mean", "shape": [32], "dtype": "float32"}, {"name": "hourglass_hg_1_depth1_depth2_up1_1_conv3_BatchNorm/moving_variance", "shape": [32], "dtype": "float32"}, {"name": "hourglass_hg_1_depth1_depth2_low3_1_conv3_BatchNorm/gamma", "shape": [32], "dtype": "float32"}, {"name": "hourglass_hg_1_depth1_depth2_low3_1_conv3_BatchNorm/beta", "shape": [32], "dtype": "float32"}, {"name": "hourglass_hg_1_depth1_depth2_low3_1_conv3_BatchNorm/moving_mean", "shape": [32], "dtype": "float32"}, {"name": "hourglass_hg_1_depth1_depth2_low3_1_conv3_BatchNorm/moving_variance", "shape": [32], "dtype": "float32"}, {"name": "hourglass_hg_1_depth1_depth2_up1_1_conv3/kernel", "shape": [1, 1, 32, 64], "dtype": "float32"}, {"name": "hourglass_hg_1_depth1_depth2_up1_1_conv3/bias", "shape": [64], "dtype": "float32"}, {"name": "hourglass_hg_1_depth1_depth2_low3_1_conv3/kernel", "shape": [1, 1, 32, 64], "dtype": "float32"}, {"name": "hourglass_hg_1_depth1_depth2_low3_1_conv3/bias", "shape": [64], "dtype": "float32"}, {"name": "hourglass_hg_1_depth1_up1_1_conv1_BatchNorm/gamma", "shape": [64], "dtype": "float32"}, {"name": "hourglass_hg_1_depth1_up1_1_conv1_BatchNorm/beta", "shape": [64], "dtype": "float32"}, {"name": "hourglass_hg_1_depth1_up1_1_conv1_BatchNorm/moving_mean", "shape": [64], "dtype": "float32"}, {"name": "hourglass_hg_1_depth1_up1_1_conv1_BatchNorm/moving_variance", "shape": [64], "dtype": "float32"}, {"name": "hourglass_hg_1_depth1_low3_1_conv1_BatchNorm/gamma", "shape": [64], "dtype": "float32"}, {"name": "hourglass_hg_1_depth1_low3_1_conv1_BatchNorm/beta", "shape": [64], "dtype": "float32"}, {"name": "hourglass_hg_1_depth1_low3_1_conv1_BatchNorm/moving_mean", "shape": [64], "dtype": "float32"}, {"name": "hourglass_hg_1_depth1_low3_1_conv1_BatchNorm/moving_variance", "shape": [64], "dtype": "float32"}, {"name": "hourglass_hg_1_depth1_up1_1_conv1/kernel", "shape": [1, 1, 64, 32], "dtype": "float32"}, {"name": "hourglass_hg_1_depth1_up1_1_conv1/bias", "shape": [32], "dtype": "float32"}, {"name": "hourglass_hg_1_depth1_low3_1_conv1/kernel", "shape": [1, 1, 64, 32], "dtype": "float32"}, {"name": "hourglass_hg_1_depth1_low3_1_conv1/bias", "shape": [32], "dtype": "float32"}, {"name": "hourglass_hg_1_depth1_up1_1_conv2_BatchNorm/gamma", "shape": [32], "dtype": "float32"}, {"name": "hourglass_hg_1_depth1_up1_1_conv2_BatchNorm/beta", "shape": [32], "dtype": "float32"}, {"name": "hourglass_hg_1_depth1_up1_1_conv2_BatchNorm/moving_mean", "shape": [32], "dtype": "float32"}, {"name": "hourglass_hg_1_depth1_up1_1_conv2_BatchNorm/moving_variance", "shape": [32], "dtype": "float32"}, {"name": "hourglass_hg_1_depth1_low3_1_conv2_BatchNorm/gamma", "shape": [32], "dtype": "float32"}, {"name": "hourglass_hg_1_depth1_low3_1_conv2_BatchNorm/beta", "shape": [32], "dtype": "float32"}, {"name": "hourglass_hg_1_depth1_low3_1_conv2_BatchNorm/moving_mean", "shape": [32], "dtype": "float32"}, {"name": "hourglass_hg_1_depth1_low3_1_conv2_BatchNorm/moving_variance", "shape": [32], "dtype": "float32"}, {"name": "hourglass_hg_1_depth1_up1_1_conv2/kernel", "shape": [3, 3, 32, 32], "dtype": "float32"}, {"name": "hourglass_hg_1_depth1_up1_1_conv2/bias", "shape": [32], "dtype": "float32"}, {"name": "hourglass_hg_1_depth1_low3_1_conv2/kernel", "shape": [3, 3, 32, 32], "dtype": "float32"}, {"name": "hourglass_hg_1_depth1_low3_1_conv2/bias", "shape": [32], "dtype": "float32"}, {"name": "hourglass_hg_1_depth1_up1_1_conv3_BatchNorm/gamma", "shape": [32], "dtype": "float32"}, {"name": "hourglass_hg_1_depth1_up1_1_conv3_BatchNorm/beta", "shape": [32], "dtype": "float32"}, {"name": "hourglass_hg_1_depth1_up1_1_conv3_BatchNorm/moving_mean", "shape": [32], "dtype": "float32"}, {"name": "hourglass_hg_1_depth1_up1_1_conv3_BatchNorm/moving_variance", "shape": [32], "dtype": "float32"}, {"name": "hourglass_hg_1_depth1_low3_1_conv3_BatchNorm/gamma", "shape": [32], "dtype": "float32"}, {"name": "hourglass_hg_1_depth1_low3_1_conv3_BatchNorm/beta", "shape": [32], "dtype": "float32"}, {"name": "hourglass_hg_1_depth1_low3_1_conv3_BatchNorm/moving_mean", "shape": [32], "dtype": "float32"}, {"name": "hourglass_hg_1_depth1_low3_1_conv3_BatchNorm/moving_variance", "shape": [32], "dtype": "float32"}, {"name": "hourglass_hg_1_depth1_up1_1_conv3/kernel", "shape": [1, 1, 32, 64], "dtype": "float32"}, {"name": "hourglass_hg_1_depth1_up1_1_conv3/bias", "shape": [64], "dtype": "float32"}, {"name": "hourglass_hg_1_depth1_low3_1_conv3/kernel", "shape": [1, 1, 32, 64], "dtype": "float32"}, {"name": "hourglass_hg_1_depth1_low3_1_conv3/bias", "shape": [64], "dtype": "float32"}, {"name": "hourglass_hg_1_after_after_hg_1_conv1_BatchNorm/gamma", "shape": [64], "dtype": "float32"}, {"name": "hourglass_hg_1_after_after_hg_1_conv1_BatchNorm/beta", "shape": [64], "dtype": "float32"}, {"name": "hourglass_hg_1_after_after_hg_1_conv1_BatchNorm/moving_mean", "shape": [64], "dtype": "float32"}, {"name": "hourglass_hg_1_after_after_hg_1_conv1_BatchNorm/moving_variance", "shape": [64], "dtype": "float32"}, {"name": "hourglass_hg_1_after_after_hg_1_conv1/kernel", "shape": [1, 1, 64, 32], "dtype": "float32"}, {"name": "hourglass_hg_1_after_after_hg_1_conv1/bias", "shape": [32], "dtype": "float32"}, {"name": "hourglass_hg_1_after_after_hg_1_conv2_BatchNorm/gamma", "shape": [32], "dtype": "float32"}, {"name": "hourglass_hg_1_after_after_hg_1_conv2_BatchNorm/beta", "shape": [32], "dtype": "float32"}, {"name": "hourglass_hg_1_after_after_hg_1_conv2_BatchNorm/moving_mean", "shape": [32], "dtype": "float32"}, {"name": "hourglass_hg_1_after_after_hg_1_conv2_BatchNorm/moving_variance", "shape": [32], "dtype": "float32"}, {"name": "hourglass_hg_1_after_after_hg_1_conv2/kernel", "shape": [3, 3, 32, 32], "dtype": "float32"}, {"name": "hourglass_hg_1_after_after_hg_1_conv2/bias", "shape": [32], "dtype": "float32"}, {"name": "hourglass_hg_1_after_after_hg_1_conv3_BatchNorm/gamma", "shape": [32], "dtype": "float32"}, {"name": "hourglass_hg_1_after_after_hg_1_conv3_BatchNorm/beta", "shape": [32], "dtype": "float32"}, {"name": "hourglass_hg_1_after_after_hg_1_conv3_BatchNorm/moving_mean", "shape": [32], "dtype": "float32"}, {"name": "hourglass_hg_1_after_after_hg_1_conv3_BatchNorm/moving_variance", "shape": [32], "dtype": "float32"}, {"name": "hourglass_hg_1_after_after_hg_1_conv3/kernel", "shape": [1, 1, 32, 64], "dtype": "float32"}, {"name": "hourglass_hg_1_after_after_hg_1_conv3/bias", "shape": [64], "dtype": "float32"}, {"name": "hourglass_hg_1_after/kernel", "shape": [1, 1, 64, 64], "dtype": "float32"}, {"name": "hourglass_hg_1_after/bias", "shape": [64], "dtype": "float32"}, {"name": "hourglass_hg_1_after_BatchNorm/gamma", "shape": [64], "dtype": "float32"}, {"name": "hourglass_hg_1_after_BatchNorm/beta", "shape": [64], "dtype": "float32"}, {"name": "hourglass_hg_1_after_BatchNorm/moving_mean", "shape": [64], "dtype": "float32"}, {"name": "hourglass_hg_1_after_BatchNorm/moving_variance", "shape": [64], "dtype": "float32"}, {"name": "hourglass_hg_1_after_hmap/kernel", "shape": [1, 1, 64, 18], "dtype": "float32"}, {"name": "hourglass_hg_1_after_hmap/bias", "shape": [18], "dtype": "float32"}, {"name": "hourglass_hg_1_merge_h/kernel", "shape": [1, 1, 18, 64], "dtype": "float32"}, {"name": "hourglass_hg_1_merge_h/bias", "shape": [64], "dtype": "float32"}, {"name": "hourglass_hg_2_depth1_low1_1_conv1_BatchNorm/gamma", "shape": [64], "dtype": "float32"}, {"name": "hourglass_hg_2_depth1_low1_1_conv1_BatchNorm/beta", "shape": [64], "dtype": "float32"}, {"name": "hourglass_hg_2_depth1_low1_1_conv1_BatchNorm/moving_mean", "shape": [64], "dtype": "float32"}, {"name": "hourglass_hg_2_depth1_low1_1_conv1_BatchNorm/moving_variance", "shape": [64], "dtype": "float32"}, {"name": "hourglass_hg_2_depth1_low1_1_conv1/kernel", "shape": [1, 1, 64, 32], "dtype": "float32"}, {"name": "hourglass_hg_2_depth1_low1_1_conv1/bias", "shape": [32], "dtype": "float32"}, {"name": "hourglass_hg_2_depth1_low1_1_conv2_BatchNorm/gamma", "shape": [32], "dtype": "float32"}, {"name": "hourglass_hg_2_depth1_low1_1_conv2_BatchNorm/beta", "shape": [32], "dtype": "float32"}, {"name": "hourglass_hg_2_depth1_low1_1_conv2_BatchNorm/moving_mean", "shape": [32], "dtype": "float32"}, {"name": "hourglass_hg_2_depth1_low1_1_conv2_BatchNorm/moving_variance", "shape": [32], "dtype": "float32"}, {"name": "hourglass_hg_2_depth1_low1_1_conv2/kernel", "shape": [3, 3, 32, 32], "dtype": "float32"}, {"name": "hourglass_hg_2_depth1_low1_1_conv2/bias", "shape": [32], "dtype": "float32"}, {"name": "hourglass_hg_2_depth1_low1_1_conv3_BatchNorm/gamma", "shape": [32], "dtype": "float32"}, {"name": "hourglass_hg_2_depth1_low1_1_conv3_BatchNorm/beta", "shape": [32], "dtype": "float32"}, {"name": "hourglass_hg_2_depth1_low1_1_conv3_BatchNorm/moving_mean", "shape": [32], "dtype": "float32"}, {"name": "hourglass_hg_2_depth1_low1_1_conv3_BatchNorm/moving_variance", "shape": [32], "dtype": "float32"}, {"name": "hourglass_hg_2_depth1_low1_1_conv3/kernel", "shape": [1, 1, 32, 64], "dtype": "float32"}, {"name": "hourglass_hg_2_depth1_low1_1_conv3/bias", "shape": [64], "dtype": "float32"}, {"name": "hourglass_hg_2_depth1_depth2_low1_1_conv1_BatchNorm/gamma", "shape": [64], "dtype": "float32"}, {"name": "hourglass_hg_2_depth1_depth2_low1_1_conv1_BatchNorm/beta", "shape": [64], "dtype": "float32"}, {"name": "hourglass_hg_2_depth1_depth2_low1_1_conv1_BatchNorm/moving_mean", "shape": [64], "dtype": "float32"}, {"name": "hourglass_hg_2_depth1_depth2_low1_1_conv1_BatchNorm/moving_variance", "shape": [64], "dtype": "float32"}, {"name": "hourglass_hg_2_depth1_depth2_low1_1_conv1/kernel", "shape": [1, 1, 64, 32], "dtype": "float32"}, {"name": "hourglass_hg_2_depth1_depth2_low1_1_conv1/bias", "shape": [32], "dtype": "float32"}, {"name": "hourglass_hg_2_depth1_depth2_low1_1_conv2_BatchNorm/gamma", "shape": [32], "dtype": "float32"}, {"name": "hourglass_hg_2_depth1_depth2_low1_1_conv2_BatchNorm/beta", "shape": [32], "dtype": "float32"}, {"name": "hourglass_hg_2_depth1_depth2_low1_1_conv2_BatchNorm/moving_mean", "shape": [32], "dtype": "float32"}, {"name": "hourglass_hg_2_depth1_depth2_low1_1_conv2_BatchNorm/moving_variance", "shape": [32], "dtype": "float32"}, {"name": "hourglass_hg_2_depth1_depth2_low1_1_conv2/kernel", "shape": [3, 3, 32, 32], "dtype": "float32"}, {"name": "hourglass_hg_2_depth1_depth2_low1_1_conv2/bias", "shape": [32], "dtype": "float32"}, {"name": "hourglass_hg_2_depth1_depth2_low1_1_conv3_BatchNorm/gamma", "shape": [32], "dtype": "float32"}, {"name": "hourglass_hg_2_depth1_depth2_low1_1_conv3_BatchNorm/beta", "shape": [32], "dtype": "float32"}, {"name": "hourglass_hg_2_depth1_depth2_low1_1_conv3_BatchNorm/moving_mean", "shape": [32], "dtype": "float32"}, {"name": "hourglass_hg_2_depth1_depth2_low1_1_conv3_BatchNorm/moving_variance", "shape": [32], "dtype": "float32"}, {"name": "hourglass_hg_2_depth1_depth2_low1_1_conv3/kernel", "shape": [1, 1, 32, 64], "dtype": "float32"}, {"name": "hourglass_hg_2_depth1_depth2_low1_1_conv3/bias", "shape": [64], "dtype": "float32"}, {"name": "hourglass_hg_2_depth1_depth2_depth3_low1_1_conv1_BatchNorm/gamma", "shape": [64], "dtype": "float32"}, {"name": "hourglass_hg_2_depth1_depth2_depth3_low1_1_conv1_BatchNorm/beta", "shape": [64], "dtype": "float32"}, {"name": "hourglass_hg_2_depth1_depth2_depth3_low1_1_conv1_BatchNorm/moving_mean", "shape": [64], "dtype": "float32"}, {"name": "hourglass_hg_2_depth1_depth2_depth3_low1_1_conv1_BatchNorm/moving_variance", "shape": [64], "dtype": "float32"}, {"name": "hourglass_hg_2_depth1_depth2_depth3_low1_1_conv1/kernel", "shape": [1, 1, 64, 32], "dtype": "float32"}, {"name": "hourglass_hg_2_depth1_depth2_depth3_low1_1_conv1/bias", "shape": [32], "dtype": "float32"}, {"name": "hourglass_hg_2_depth1_depth2_depth3_low1_1_conv2_BatchNorm/gamma", "shape": [32], "dtype": "float32"}, {"name": "hourglass_hg_2_depth1_depth2_depth3_low1_1_conv2_BatchNorm/beta", "shape": [32], "dtype": "float32"}, {"name": "hourglass_hg_2_depth1_depth2_depth3_low1_1_conv2_BatchNorm/moving_mean", "shape": [32], "dtype": "float32"}, {"name": "hourglass_hg_2_depth1_depth2_depth3_low1_1_conv2_BatchNorm/moving_variance", "shape": [32], "dtype": "float32"}, {"name": "hourglass_hg_2_depth1_depth2_depth3_low1_1_conv2/kernel", "shape": [3, 3, 32, 32], "dtype": "float32"}, {"name": "hourglass_hg_2_depth1_depth2_depth3_low1_1_conv2/bias", "shape": [32], "dtype": "float32"}, {"name": "hourglass_hg_2_depth1_depth2_depth3_low1_1_conv3_BatchNorm/gamma", "shape": [32], "dtype": "float32"}, {"name": "hourglass_hg_2_depth1_depth2_depth3_low1_1_conv3_BatchNorm/beta", "shape": [32], "dtype": "float32"}, {"name": "hourglass_hg_2_depth1_depth2_depth3_low1_1_conv3_BatchNorm/moving_mean", "shape": [32], "dtype": "float32"}, {"name": "hourglass_hg_2_depth1_depth2_depth3_low1_1_conv3_BatchNorm/moving_variance", "shape": [32], "dtype": "float32"}, {"name": "hourglass_hg_2_depth1_depth2_depth3_low1_1_conv3/kernel", "shape": [1, 1, 32, 64], "dtype": "float32"}, {"name": "hourglass_hg_2_depth1_depth2_depth3_low1_1_conv3/bias", "shape": [64], "dtype": "float32"}, {"name": "hourglass_hg_2_depth1_depth2_depth3_depth4_low1_1_conv1_BatchNorm/gamma", "shape": [64], "dtype": "float32"}, {"name": "hourglass_hg_2_depth1_depth2_depth3_depth4_low1_1_conv1_BatchNorm/beta", "shape": [64], "dtype": "float32"}, {"name": "hourglass_hg_2_depth1_depth2_depth3_depth4_low1_1_conv1_BatchNorm/moving_mean", "shape": [64], "dtype": "float32"}, {"name": "hourglass_hg_2_depth1_depth2_depth3_depth4_low1_1_conv1_BatchNorm/moving_variance", "shape": [64], "dtype": "float32"}, {"name": "hourglass_hg_2_depth1_depth2_depth3_depth4_low1_1_conv1/kernel", "shape": [1, 1, 64, 32], "dtype": "float32"}, {"name": "hourglass_hg_2_depth1_depth2_depth3_depth4_low1_1_conv1/bias", "shape": [32], "dtype": "float32"}, {"name": "hourglass_hg_2_depth1_depth2_depth3_depth4_low1_1_conv2_BatchNorm/gamma", "shape": [32], "dtype": "float32"}, {"name": "hourglass_hg_2_depth1_depth2_depth3_depth4_low1_1_conv2_BatchNorm/beta", "shape": [32], "dtype": "float32"}, {"name": "hourglass_hg_2_depth1_depth2_depth3_depth4_low1_1_conv2_BatchNorm/moving_mean", "shape": [32], "dtype": "float32"}, {"name": "hourglass_hg_2_depth1_depth2_depth3_depth4_low1_1_conv2_BatchNorm/moving_variance", "shape": [32], "dtype": "float32"}, {"name": "hourglass_hg_2_depth1_depth2_depth3_depth4_low1_1_conv2/kernel", "shape": [3, 3, 32, 32], "dtype": "float32"}, {"name": "hourglass_hg_2_depth1_depth2_depth3_depth4_low1_1_conv2/bias", "shape": [32], "dtype": "float32"}, {"name": "hourglass_hg_2_depth1_depth2_depth3_depth4_low1_1_conv3_BatchNorm/gamma", "shape": [32], "dtype": "float32"}, {"name": "hourglass_hg_2_depth1_depth2_depth3_depth4_low1_1_conv3_BatchNorm/beta", "shape": [32], "dtype": "float32"}, {"name": "hourglass_hg_2_depth1_depth2_depth3_depth4_low1_1_conv3_BatchNorm/moving_mean", "shape": [32], "dtype": "float32"}, {"name": "hourglass_hg_2_depth1_depth2_depth3_depth4_low1_1_conv3_BatchNorm/moving_variance", "shape": [32], "dtype": "float32"}, {"name": "hourglass_hg_2_depth1_depth2_depth3_depth4_low1_1_conv3/kernel", "shape": [1, 1, 32, 64], "dtype": "float32"}, {"name": "hourglass_hg_2_depth1_depth2_depth3_depth4_low1_1_conv3/bias", "shape": [64], "dtype": "float32"}, {"name": "hourglass_hg_2_depth1_depth2_depth3_depth4_low2_1_conv1_BatchNorm/gamma", "shape": [64], "dtype": "float32"}, {"name": "hourglass_hg_2_depth1_depth2_depth3_depth4_low2_1_conv1_BatchNorm/beta", "shape": [64], "dtype": "float32"}, {"name": "hourglass_hg_2_depth1_depth2_depth3_depth4_low2_1_conv1_BatchNorm/moving_mean", "shape": [64], "dtype": "float32"}, {"name": "hourglass_hg_2_depth1_depth2_depth3_depth4_low2_1_conv1_BatchNorm/moving_variance", "shape": [64], "dtype": "float32"}, {"name": "hourglass_hg_2_depth1_depth2_depth3_depth4_low2_1_conv1/kernel", "shape": [1, 1, 64, 32], "dtype": "float32"}, {"name": "hourglass_hg_2_depth1_depth2_depth3_depth4_low2_1_conv1/bias", "shape": [32], "dtype": "float32"}, {"name": "hourglass_hg_2_depth1_depth2_depth3_depth4_low2_1_conv2_BatchNorm/gamma", "shape": [32], "dtype": "float32"}, {"name": "hourglass_hg_2_depth1_depth2_depth3_depth4_low2_1_conv2_BatchNorm/beta", "shape": [32], "dtype": "float32"}, {"name": "hourglass_hg_2_depth1_depth2_depth3_depth4_low2_1_conv2_BatchNorm/moving_mean", "shape": [32], "dtype": "float32"}, {"name": "hourglass_hg_2_depth1_depth2_depth3_depth4_low2_1_conv2_BatchNorm/moving_variance", "shape": [32], "dtype": "float32"}, {"name": "hourglass_hg_2_depth1_depth2_depth3_depth4_low2_1_conv2/kernel", "shape": [3, 3, 32, 32], "dtype": "float32"}, {"name": "hourglass_hg_2_depth1_depth2_depth3_depth4_low2_1_conv2/bias", "shape": [32], "dtype": "float32"}, {"name": "hourglass_hg_2_depth1_depth2_depth3_depth4_low2_1_conv3_BatchNorm/gamma", "shape": [32], "dtype": "float32"}, {"name": "hourglass_hg_2_depth1_depth2_depth3_depth4_low2_1_conv3_BatchNorm/beta", "shape": [32], "dtype": "float32"}, {"name": "hourglass_hg_2_depth1_depth2_depth3_depth4_low2_1_conv3_BatchNorm/moving_mean", "shape": [32], "dtype": "float32"}, {"name": "hourglass_hg_2_depth1_depth2_depth3_depth4_low2_1_conv3_BatchNorm/moving_variance", "shape": [32], "dtype": "float32"}, {"name": "hourglass_hg_2_depth1_depth2_depth3_depth4_low2_1_conv3/kernel", "shape": [1, 1, 32, 64], "dtype": "float32"}, {"name": "hourglass_hg_2_depth1_depth2_depth3_depth4_low2_1_conv3/bias", "shape": [64], "dtype": "float32"}, {"name": "hourglass_hg_2_depth1_depth2_depth3_depth4_up1_1_conv1_BatchNorm/gamma", "shape": [64], "dtype": "float32"}, {"name": "hourglass_hg_2_depth1_depth2_depth3_depth4_up1_1_conv1_BatchNorm/beta", "shape": [64], "dtype": "float32"}, {"name": "hourglass_hg_2_depth1_depth2_depth3_depth4_up1_1_conv1_BatchNorm/moving_mean", "shape": [64], "dtype": "float32"}, {"name": "hourglass_hg_2_depth1_depth2_depth3_depth4_up1_1_conv1_BatchNorm/moving_variance", "shape": [64], "dtype": "float32"}, {"name": "hourglass_hg_2_depth1_depth2_depth3_depth4_low3_1_conv1_BatchNorm/gamma", "shape": [64], "dtype": "float32"}, {"name": "hourglass_hg_2_depth1_depth2_depth3_depth4_low3_1_conv1_BatchNorm/beta", "shape": [64], "dtype": "float32"}, {"name": "hourglass_hg_2_depth1_depth2_depth3_depth4_low3_1_conv1_BatchNorm/moving_mean", "shape": [64], "dtype": "float32"}, {"name": "hourglass_hg_2_depth1_depth2_depth3_depth4_low3_1_conv1_BatchNorm/moving_variance", "shape": [64], "dtype": "float32"}, {"name": "hourglass_hg_2_depth1_depth2_depth3_depth4_up1_1_conv1/kernel", "shape": [1, 1, 64, 32], "dtype": "float32"}, {"name": "hourglass_hg_2_depth1_depth2_depth3_depth4_up1_1_conv1/bias", "shape": [32], "dtype": "float32"}, {"name": "hourglass_hg_2_depth1_depth2_depth3_depth4_low3_1_conv1/kernel", "shape": [1, 1, 64, 32], "dtype": "float32"}, {"name": "hourglass_hg_2_depth1_depth2_depth3_depth4_low3_1_conv1/bias", "shape": [32], "dtype": "float32"}, {"name": "hourglass_hg_2_depth1_depth2_depth3_depth4_up1_1_conv2_BatchNorm/gamma", "shape": [32], "dtype": "float32"}, {"name": "hourglass_hg_2_depth1_depth2_depth3_depth4_up1_1_conv2_BatchNorm/beta", "shape": [32], "dtype": "float32"}, {"name": "hourglass_hg_2_depth1_depth2_depth3_depth4_up1_1_conv2_BatchNorm/moving_mean", "shape": [32], "dtype": "float32"}, {"name": "hourglass_hg_2_depth1_depth2_depth3_depth4_up1_1_conv2_BatchNorm/moving_variance", "shape": [32], "dtype": "float32"}, {"name": "hourglass_hg_2_depth1_depth2_depth3_depth4_low3_1_conv2_BatchNorm/gamma", "shape": [32], "dtype": "float32"}, {"name": "hourglass_hg_2_depth1_depth2_depth3_depth4_low3_1_conv2_BatchNorm/beta", "shape": [32], "dtype": "float32"}, {"name": "hourglass_hg_2_depth1_depth2_depth3_depth4_low3_1_conv2_BatchNorm/moving_mean", "shape": [32], "dtype": "float32"}, {"name": "hourglass_hg_2_depth1_depth2_depth3_depth4_low3_1_conv2_BatchNorm/moving_variance", "shape": [32], "dtype": "float32"}, {"name": "hourglass_hg_2_depth1_depth2_depth3_depth4_up1_1_conv2/kernel", "shape": [3, 3, 32, 32], "dtype": "float32"}, {"name": "hourglass_hg_2_depth1_depth2_depth3_depth4_up1_1_conv2/bias", "shape": [32], "dtype": "float32"}, {"name": "hourglass_hg_2_depth1_depth2_depth3_depth4_low3_1_conv2/kernel", "shape": [3, 3, 32, 32], "dtype": "float32"}, {"name": "hourglass_hg_2_depth1_depth2_depth3_depth4_low3_1_conv2/bias", "shape": [32], "dtype": "float32"}, {"name": "hourglass_hg_2_depth1_depth2_depth3_depth4_up1_1_conv3_BatchNorm/gamma", "shape": [32], "dtype": "float32"}, {"name": "hourglass_hg_2_depth1_depth2_depth3_depth4_up1_1_conv3_BatchNorm/beta", "shape": [32], "dtype": "float32"}, {"name": "hourglass_hg_2_depth1_depth2_depth3_depth4_up1_1_conv3_BatchNorm/moving_mean", "shape": [32], "dtype": "float32"}, {"name": "hourglass_hg_2_depth1_depth2_depth3_depth4_up1_1_conv3_BatchNorm/moving_variance", "shape": [32], "dtype": "float32"}, {"name": "hourglass_hg_2_depth1_depth2_depth3_depth4_low3_1_conv3_BatchNorm/gamma", "shape": [32], "dtype": "float32"}, {"name": "hourglass_hg_2_depth1_depth2_depth3_depth4_low3_1_conv3_BatchNorm/beta", "shape": [32], "dtype": "float32"}, {"name": "hourglass_hg_2_depth1_depth2_depth3_depth4_low3_1_conv3_BatchNorm/moving_mean", "shape": [32], "dtype": "float32"}, {"name": "hourglass_hg_2_depth1_depth2_depth3_depth4_low3_1_conv3_BatchNorm/moving_variance", "shape": [32], "dtype": "float32"}, {"name": "hourglass_hg_2_depth1_depth2_depth3_depth4_up1_1_conv3/kernel", "shape": [1, 1, 32, 64], "dtype": "float32"}, {"name": "hourglass_hg_2_depth1_depth2_depth3_depth4_up1_1_conv3/bias", "shape": [64], "dtype": "float32"}, {"name": "hourglass_hg_2_depth1_depth2_depth3_depth4_low3_1_conv3/kernel", "shape": [1, 1, 32, 64], "dtype": "float32"}, {"name": "hourglass_hg_2_depth1_depth2_depth3_depth4_low3_1_conv3/bias", "shape": [64], "dtype": "float32"}, {"name": "hourglass_hg_2_depth1_depth2_depth3_up1_1_conv1_BatchNorm/gamma", "shape": [64], "dtype": "float32"}, {"name": "hourglass_hg_2_depth1_depth2_depth3_up1_1_conv1_BatchNorm/beta", "shape": [64], "dtype": "float32"}, {"name": "hourglass_hg_2_depth1_depth2_depth3_up1_1_conv1_BatchNorm/moving_mean", "shape": [64], "dtype": "float32"}, {"name": "hourglass_hg_2_depth1_depth2_depth3_up1_1_conv1_BatchNorm/moving_variance", "shape": [64], "dtype": "float32"}, {"name": "hourglass_hg_2_depth1_depth2_depth3_low3_1_conv1_BatchNorm/gamma", "shape": [64], "dtype": "float32"}, {"name": "hourglass_hg_2_depth1_depth2_depth3_low3_1_conv1_BatchNorm/beta", "shape": [64], "dtype": "float32"}, {"name": "hourglass_hg_2_depth1_depth2_depth3_low3_1_conv1_BatchNorm/moving_mean", "shape": [64], "dtype": "float32"}, {"name": "hourglass_hg_2_depth1_depth2_depth3_low3_1_conv1_BatchNorm/moving_variance", "shape": [64], "dtype": "float32"}, {"name": "hourglass_hg_2_depth1_depth2_depth3_up1_1_conv1/kernel", "shape": [1, 1, 64, 32], "dtype": "float32"}, {"name": "hourglass_hg_2_depth1_depth2_depth3_up1_1_conv1/bias", "shape": [32], "dtype": "float32"}, {"name": "hourglass_hg_2_depth1_depth2_depth3_low3_1_conv1/kernel", "shape": [1, 1, 64, 32], "dtype": "float32"}, {"name": "hourglass_hg_2_depth1_depth2_depth3_low3_1_conv1/bias", "shape": [32], "dtype": "float32"}, {"name": "hourglass_hg_2_depth1_depth2_depth3_up1_1_conv2_BatchNorm/gamma", "shape": [32], "dtype": "float32"}, {"name": "hourglass_hg_2_depth1_depth2_depth3_up1_1_conv2_BatchNorm/beta", "shape": [32], "dtype": "float32"}, {"name": "hourglass_hg_2_depth1_depth2_depth3_up1_1_conv2_BatchNorm/moving_mean", "shape": [32], "dtype": "float32"}, {"name": "hourglass_hg_2_depth1_depth2_depth3_up1_1_conv2_BatchNorm/moving_variance", "shape": [32], "dtype": "float32"}, {"name": "hourglass_hg_2_depth1_depth2_depth3_low3_1_conv2_BatchNorm/gamma", "shape": [32], "dtype": "float32"}, {"name": "hourglass_hg_2_depth1_depth2_depth3_low3_1_conv2_BatchNorm/beta", "shape": [32], "dtype": "float32"}, {"name": "hourglass_hg_2_depth1_depth2_depth3_low3_1_conv2_BatchNorm/moving_mean", "shape": [32], "dtype": "float32"}, {"name": "hourglass_hg_2_depth1_depth2_depth3_low3_1_conv2_BatchNorm/moving_variance", "shape": [32], "dtype": "float32"}, {"name": "hourglass_hg_2_depth1_depth2_depth3_up1_1_conv2/kernel", "shape": [3, 3, 32, 32], "dtype": "float32"}, {"name": "hourglass_hg_2_depth1_depth2_depth3_up1_1_conv2/bias", "shape": [32], "dtype": "float32"}, {"name": "hourglass_hg_2_depth1_depth2_depth3_low3_1_conv2/kernel", "shape": [3, 3, 32, 32], "dtype": "float32"}, {"name": 